In [ ]:
# https://scikit-learn.org/stable/modules/multiclass.html

In [1]:
# Import libraries
import pandas as pd
import numpy as np
pd.set_option('max_colwidth', 400)
import requests
import matplotlib.pyplot as plt
import json
import re
import warnings
warnings.filterwarnings('ignore')
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
import tensorflow as tf

In [2]:
from sklearn.datasets import make_regression
from sklearn.multioutput import MultiOutputRegressor
from sklearn.ensemble import GradientBoostingRegressor

In [3]:
# # Read csv and create dataframe
# from google.colab import files
# uploaded = files.upload()

In [4]:
import io
salaries_df = pd.read_csv('salaries_cleaned.csv')

In [5]:
layoffs_df = pd.read_csv('layoffs_cleaned.csv')

In [6]:
# from google.colab import files
# uploaded = files.upload()

In [7]:
salaries_df.head()

,Unnamed: 0,timestamp,date,company,level,title,totalyearlycompensation,location,latitude,longitude,yearsofexperience,yearsatcompany,basesalary,stockgrantvalue,bonus,gender,Race,Education
0,0,2017-06-07 11:33:00,2017-06-07 00:00:00,Oracle,L3,Product Manager,127000,"Redwood City, CA",37.486324,-122.232523,1.5,1.5,107000,20000,10000,Unknown,Unknown,Unknown
1,1,2017-06-10 17:11:00,2017-06-10 00:00:00,eBay,SE 2,Software Engineer,100000,"San Francisco, CA",37.779026,-122.419906,5.0,3.0,0,0,0,Unknown,Unknown,Unknown
2,2,2017-06-11 14:53:00,2017-06-11 00:00:00,Amazon,L7,Product Manager,310000,"Seattle, WA",47.603832,-122.330062,8.0,0.0,155000,0,0,Unknown,Unknown,Unknown
3,3,2017-06-17 00:23:00,2017-06-17 00:00:00,Apple,M1,Software Engineering Manager,372000,"Sunnyvale, CA",37.368830,-122.036349,7.0,5.0,157000,180000,35000,Unknown,Unknown,Unknown
4,4,2017-06-20 10:58:00,2017-06-20 00:00:00,Microsoft,60,Software Engineer,157000,"Mountain View, CA",37.389389,-122.083210,5.0,3.0,0,0,0,Unknown,Unknown,Unknown

In [8]:
salaries_df['location'].value_counts()

Seattle, WA                      8701
San Francisco, CA                6797
New York, NY                     4562
Redmond, WA                      2649
Mountain View, CA                2275
                                 ...
San Fernando, LB, Philippines       1
Suwanee, GA                         1
Oxford, MS                          1
Wayne, PA                           1
Hilbert, WI                         1
Name: location, Length: 1050, dtype: int64

In [9]:
layoffs_df

,Unnamed: 0,company,location,industry,total_laid_off,percentage_laid_off,date,stage,country
0,0,N26,Berlin,Finance,71,4.0,2023-04-28,Series E,United States
1,1,Providoor,Melbourne,Food,0,100.0,2023-04-28,Unknown,Australia
2,2,Dropbox,SF Bay Area,Other,500,16.0,2023-04-27,Post-IPO,United States
3,3,Vroom,New York City,Transportation,120,11.0,2023-04-27,Post-IPO,United States
4,4,Greenhouse,New York City,Recruiting,100,12.0,2023-04-27,Private Equity,United States
...,...,...,...,...,...,...,...,...,...
2540,2540,Panda Squad,SF Bay Area,Consumer,6,75.0,2020-03-13,Seed,United States
2541,2541,Tamara Mellon,Los Angeles,Retail,20,40.0,2020-03-12,Series C,United States
2542,2542,EasyPost,Salt Lake City,Logistics,75,NaN,2020-03-11,Series A,United States
2543,2543,Blackbaud,Charleston,Other,500,14.0,NaN,Post-IPO,United States
2544,2544,Open,Bengaluru,Finance,47,NaN,NaN,Series D,India

In [10]:
layoffs_df_update=layoffs_df[['company', 'total_laid_off', 'percentage_laid_off']]
layoffs_df_update

            company  total_laid_off  percentage_laid_off
0               N26              71                  4.0
1         Providoor               0                100.0
2           Dropbox             500                 16.0
3             Vroom             120                 11.0
4        Greenhouse             100                 12.0
...             ...             ...                  ...
2540    Panda Squad               6                 75.0
2541  Tamara Mellon              20                 40.0
2542       EasyPost              75                  NaN
2543      Blackbaud             500                 14.0
2544           Open              47                  NaN

[2545 rows x 3 columns]

In [11]:
layoff_list=layoffs_df_update['company'].unique()
layoff_list

array(['N26', 'Providoor', 'Dropbox', ..., 'Tamara Mellon', 'Blackbaud',
       'Open'], dtype=object)

In [12]:
salaries_df['layoff_happened']=0

In [13]:
salaries_df

,Unnamed: 0,timestamp,date,company,level,title,totalyearlycompensation,location,latitude,longitude,yearsofexperience,yearsatcompany,basesalary,stockgrantvalue,bonus,gender,Race,Education,layoff_happened
0,0,2017-06-07 11:33:00,2017-06-07 00:00:00,Oracle,L3,Product Manager,127000,"Redwood City, CA",37.486324,-122.232523,1.5,1.5,107000,20000,10000,Unknown,Unknown,Unknown,0
1,1,2017-06-10 17:11:00,2017-06-10 00:00:00,eBay,SE 2,Software Engineer,100000,"San Francisco, CA",37.779026,-122.419906,5.0,3.0,0,0,0,Unknown,Unknown,Unknown,0
2,2,2017-06-11 14:53:00,2017-06-11 00:00:00,Amazon,L7,Product Manager,310000,"Seattle, WA",47.603832,-122.330062,8.0,0.0,155000,0,0,Unknown,Unknown,Unknown,0
3,3,2017-06-17 00:23:00,2017-06-17 00:00:00,Apple,M1,Software Engineering Manager,372000,"Sunnyvale, CA",37.368830,-122.036349,7.0,5.0,157000,180000,35000,Unknown,Unknown,Unknown,0
4,4,2017-06-20 10:58:00,2017-06-20 00:00:00,Microsoft,60,Software Engineer,157000,"Mountain View, CA",37.389389,-122.083210,5.0,3.0,0,0,0,Unknown,Unknown,Unknown,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
62637,62637,2018-09-09 11:52:00,2018-09-09 00:00:00,Google,T4,Software Engineer,327000,"Seattle, WA",47.603832,-122.330062,10.0,1.0,155000,150000,22000,Unknown,Unknown,Unknown,0
62638,62638,2018-09-13 08:23:00,2018-09-13 00:00:00,Microsoft,62,Software Engineer,237000,"Redmond, WA",47.669414,-122.123877,2.0,2.0,146900,73200,16000,Unknown,Unknown,Unknown,0
62639,62639,2018-09-13 14:35:00,2018-09-13 00:00:00,MSFT,63,Software Engineer,220000,"Seattle, WA",47.603832,-122.330062,14.0,12.0,157000,25000,20000,Unknown,Unknown,Unknown,0
62640,62640,2018-09-16 16:10:00,2018-09-16 00:00:00,SalesForce,Lead MTS,Software Engineer,280000,"San Francisco, CA",37.779026,-122.419906,8.0,4.0,194688,57000,29000,Unknown,Unknown,Unknown,0
62641,62641,2019-01-29 05:12:00,2019-01-29 00:00:00,Apple,ict3,Software Engineer,200000,"Sunnyvale, CA",37.368830,-122.036349,0.0,0.0,155000,27000,19000,Male,Unknown,Unknown,0

In [14]:
for x in range(len(salaries_df['company'])):
    if salaries_df['company'][x] in layoff_list:
        salaries_df['layoff_happened'][x] = 1

In [15]:
salaries_df['layoff_happened'].value_counts()

1    39888
0    22754
Name: layoff_happened, dtype: int64

In [16]:
salaries_df.columns

Index(['Unnamed: 0', 'timestamp', 'date', 'company', 'level', 'title',
       'totalyearlycompensation', 'location', 'latitude', 'longitude',
       'yearsofexperience', 'yearsatcompany', 'basesalary', 'stockgrantvalue',
       'bonus', 'gender', 'Race', 'Education', 'layoff_happened'],
      dtype='object')

                              title
Human Resources                 364
Recruiter                       451
Sales                           461
Mechanical Engineer             490
Marketing                       710
Business Analyst                885
Management Consultant           976
Solution Architect             1157
Technical Program Manager      1381
Product Designer               1516
Hardware Engineer              2200
Data Scientist                 2578
Software Engineering Manager   3569
Product Manager                4673
Software Engineer             41231

In [17]:
salaries_df['company'].value_counts()

Amazon             8208
Microsoft          5252
Google             4367
Facebook           3004
Apple              2055
                   ...
CSV Health            1
Mckinsey              1
Tune                  1
Jp morgan chase       1
Csg                   1
Name: company, Length: 1076, dtype: int64

In [18]:
val=salaries_df['company'].value_counts()
print(val[val>25])

Amazon           8208
Microsoft        5252
Google           4367
Facebook         3004
Apple            2055
                 ...
Glassdoor          26
Sony               26
HBO                26
ZS Associates      26
Huawei             26
Name: company, Length: 264, dtype: int64

In [19]:
#companies over 25 jobs
comapanies_to_replace=[]
company=salaries_df['company'].value_counts()
company=pd.DataFrame(company)
company.head(20)

                company
Amazon             8208
Microsoft          5252
Google             4367
Facebook           3004
Apple              2055
Oracle             1143
SalesForce         1065
Intel               991
Cisco               943
IBM                 927
Uber                893
Capital One         786
LinkedIn            750
VMware              682
Qualcomm            578
JPMorgan Chase      575
Bloomberg           547
Goldman Sachs       474
PayPal              451
Intuit              450

In [20]:
comapanies_to_replace.append(company[company.company<15].index)

AttributeError: 'list' object has no attribute 'value_counts'

In [21]:
#Replaced with other for all companies besides the top 20
for x in comapanies_to_replace:
    salaries_df['company'] = salaries_df['company'].replace(x,"Other")
    
# Check to make sure binning was successful
salaries_df['company'].value_counts()

Amazon                  8208
Microsoft               5252
Other                   4895
Google                  4367
Facebook                3004
                        ...
Adyen                     15
WePay                     15
Kroger                    15
National Instruments      15
WarnerMedia               15
Name: company, Length: 398, dtype: int64

In [22]:
year_df=salaries_df['date'].str.split('-', expand=True)

In [23]:
salaries_df['date']=year_df[0]

In [24]:
salaries_df['month']=year_df[1]

In [25]:
salaries_df

,Unnamed: 0,timestamp,date,company,level,title,totalyearlycompensation,location,latitude,longitude,yearsofexperience,yearsatcompany,basesalary,stockgrantvalue,bonus,gender,Race,Education,layoff_happened,month
0,0,2017-06-07 11:33:00,2017,Oracle,L3,Product Manager,127000,"Redwood City, CA",37.486324,-122.232523,1.5,1.5,107000,20000,10000,Unknown,Unknown,Unknown,1,06
1,1,2017-06-10 17:11:00,2017,eBay,SE 2,Software Engineer,100000,"San Francisco, CA",37.779026,-122.419906,5.0,3.0,0,0,0,Unknown,Unknown,Unknown,1,06
2,2,2017-06-11 14:53:00,2017,Amazon,L7,Product Manager,310000,"Seattle, WA",47.603832,-122.330062,8.0,0.0,155000,0,0,Unknown,Unknown,Unknown,1,06
3,3,2017-06-17 00:23:00,2017,Apple,M1,Software Engineering Manager,372000,"Sunnyvale, CA",37.368830,-122.036349,7.0,5.0,157000,180000,35000,Unknown,Unknown,Unknown,1,06
4,4,2017-06-20 10:58:00,2017,Microsoft,60,Software Engineer,157000,"Mountain View, CA",37.389389,-122.083210,5.0,3.0,0,0,0,Unknown,Unknown,Unknown,1,06
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
62637,62637,2018-09-09 11:52:00,2018,Google,T4,Software Engineer,327000,"Seattle, WA",47.603832,-122.330062,10.0,1.0,155000,150000,22000,Unknown,Unknown,Unknown,1,09
62638,62638,2018-09-13 08:23:00,2018,Microsoft,62,Software Engineer,237000,"Redmond, WA",47.669414,-122.123877,2.0,2.0,146900,73200,16000,Unknown,Unknown,Unknown,1,09
62639,62639,2018-09-13 14:35:00,2018,Other,63,Software Engineer,220000,"Seattle, WA",47.603832,-122.330062,14.0,12.0,157000,25000,20000,Unknown,Unknown,Unknown,0,09
62640,62640,2018-09-16 16:10:00,2018,SalesForce,Lead MTS,Software Engineer,280000,"San Francisco, CA",37.779026,-122.419906,8.0,4.0,194688,57000,29000,Unknown,Unknown,Unknown,0,09
62641,62641,2019-01-29 05:12:00,2019,Apple,ict3,Software Engineer,200000,"Sunnyvale, CA",37.368830,-122.036349,0.0,0.0,155000,27000,19000,Male,Unknown,Unknown,1,01

In [26]:
salaries_df['level'].value_counts()

L4                              5014
L5                              4871
L3                              3337
L6                              2871
Senior Software Engineer        1443
                                ...
Gr 7                               1
Senior BA                          1
Consulting Analyst                 1
Senior Technical Director II       1
Bioinformatics Scientist II        1
Name: level, Length: 2916, dtype: int64

In [27]:
#companies over 25 jobs
levels_to_replace=[]
levels=salaries_df['level'].value_counts()
levels=pd.DataFrame(levels)
levels.head(20)

                          level
L4                         5014
L5                         4871
L3                         3337
L6                         2871
Senior Software Engineer   1443
L2                         1163
Senior                     1079
L7                          919
L1                          765
62                          764
63                          752
E5                          744
ICT4                        736
Software Engineer           735
61                          723
IC3                         656
IC4                         649
E4                          624
ICT3                        620
60                          610

In [29]:
levels_to_replace.append(levels[levels.level<15].index)

In [30]:
for x in levels_to_replace:
    salaries_df['level'] = salaries_df['level'].replace(x,"Other")
    
# Check to make sure binning was successful
salaries_df['level'].value_counts()

Other                            5668
L4                               5014
L5                               4871
L3                               3337
L6                               2871
                                 ...
New grad                           15
Engineer I                         15
Only one level across Netflix      15
Grade 14                           15
PR3                                15
Name: level, Length: 326, dtype: int64

In [31]:
salaries_df

,Unnamed: 0,timestamp,date,company,level,title,totalyearlycompensation,location,latitude,longitude,yearsofexperience,yearsatcompany,basesalary,stockgrantvalue,bonus,gender,Race,Education,layoff_happened,month
0,0,2017-06-07 11:33:00,2017,Oracle,L3,Product Manager,127000,"Redwood City, CA",37.486324,-122.232523,1.5,1.5,107000,20000,10000,Unknown,Unknown,Unknown,1,06
1,1,2017-06-10 17:11:00,2017,eBay,SE 2,Software Engineer,100000,"San Francisco, CA",37.779026,-122.419906,5.0,3.0,0,0,0,Unknown,Unknown,Unknown,1,06
2,2,2017-06-11 14:53:00,2017,Amazon,L7,Product Manager,310000,"Seattle, WA",47.603832,-122.330062,8.0,0.0,155000,0,0,Unknown,Unknown,Unknown,1,06
3,3,2017-06-17 00:23:00,2017,Apple,M1,Software Engineering Manager,372000,"Sunnyvale, CA",37.368830,-122.036349,7.0,5.0,157000,180000,35000,Unknown,Unknown,Unknown,1,06
4,4,2017-06-20 10:58:00,2017,Microsoft,60,Software Engineer,157000,"Mountain View, CA",37.389389,-122.083210,5.0,3.0,0,0,0,Unknown,Unknown,Unknown,1,06
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
62637,62637,2018-09-09 11:52:00,2018,Google,T4,Software Engineer,327000,"Seattle, WA",47.603832,-122.330062,10.0,1.0,155000,150000,22000,Unknown,Unknown,Unknown,1,09
62638,62638,2018-09-13 08:23:00,2018,Microsoft,62,Software Engineer,237000,"Redmond, WA",47.669414,-122.123877,2.0,2.0,146900,73200,16000,Unknown,Unknown,Unknown,1,09
62639,62639,2018-09-13 14:35:00,2018,Other,63,Software Engineer,220000,"Seattle, WA",47.603832,-122.330062,14.0,12.0,157000,25000,20000,Unknown,Unknown,Unknown,0,09
62640,62640,2018-09-16 16:10:00,2018,SalesForce,Lead MTS,Software Engineer,280000,"San Francisco, CA",37.779026,-122.419906,8.0,4.0,194688,57000,29000,Unknown,Unknown,Unknown,0,09
62641,62641,2019-01-29 05:12:00,2019,Apple,Other,Software Engineer,200000,"Sunnyvale, CA",37.368830,-122.036349,0.0,0.0,155000,27000,19000,Male,Unknown,Unknown,1,01

In [32]:
locations_to_replace=[]
locations=salaries_df['location'].value_counts()
locations=pd.DataFrame(locations)
locations.head(20)

                            location
Seattle, WA                     8701
San Francisco, CA               6797
New York, NY                    4562
Redmond, WA                     2649
Mountain View, CA               2275
Sunnyvale, CA                   2248
San Jose, CA                    2047
Austin, TX                      1527
Menlo Park, CA                  1440
Cupertino, CA                   1431
Bangalore, KA, India            1199
Santa Clara, CA                 1196
Boston, MA                      1190
Palo Alto, CA                   1146
London, EN, United Kingdom      1024
San Diego, CA                    839
Chicago, IL                      806
Toronto, ON, Canada              742
Bellevue, WA                     737
Los Angeles, CA                  714

In [33]:
locations_to_replace.append(locations[locations.location<15].index)

In [34]:
for x in locations_to_replace:
    salaries_df['location'] = salaries_df['location'].replace(x,"Other")
    
# Check to make sure binning was successful
salaries_df['location'].value_counts()

Seattle, WA            8701
San Francisco, CA      6797
New York, NY           4562
Redmond, WA            2649
Other                  2600
                       ...
Shenzhen, GD, China      15
Pasadena, CA             15
Princeton, NJ            15
Hangzhou, ZJ, China      15
Grand Rapids, MI         15
Name: location, Length: 198, dtype: int64

In [35]:
reduced_df = salaries_df[[ 'company', 'date', 'title', 'location', 'totalyearlycompensation', 'gender',
       'yearsofexperience', 'yearsatcompany',  'month', 'bonus', 'stockgrantvalue', 'layoff_happened']]

In [36]:
reduced_df

,company,date,title,location,totalyearlycompensation,gender,yearsofexperience,yearsatcompany,month,bonus,stockgrantvalue,layoff_happened
0,Oracle,2017,Product Manager,"Redwood City, CA",127000,Unknown,1.5,1.5,06,10000,20000,1
1,eBay,2017,Software Engineer,"San Francisco, CA",100000,Unknown,5.0,3.0,06,0,0,1
2,Amazon,2017,Product Manager,"Seattle, WA",310000,Unknown,8.0,0.0,06,0,0,1
3,Apple,2017,Software Engineering Manager,"Sunnyvale, CA",372000,Unknown,7.0,5.0,06,35000,180000,1
4,Microsoft,2017,Software Engineer,"Mountain View, CA",157000,Unknown,5.0,3.0,06,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...
62637,Google,2018,Software Engineer,"Seattle, WA",327000,Unknown,10.0,1.0,09,22000,150000,1
62638,Microsoft,2018,Software Engineer,"Redmond, WA",237000,Unknown,2.0,2.0,09,16000,73200,1
62639,Other,2018,Software Engineer,"Seattle, WA",220000,Unknown,14.0,12.0,09,20000,25000,0
62640,SalesForce,2018,Software Engineer,"San Francisco, CA",280000,Unknown,8.0,4.0,09,29000,57000,0
62641,Apple,2019,Software Engineer,"Sunnyvale, CA",200000,Male,0.0,0.0,01,19000,27000,1

In [37]:
dummies_df = pd.get_dummies(reduced_df)
dummies_df.head()

,totalyearlycompensation,yearsofexperience,yearsatcompany,bonus,stockgrantvalue,layoff_happened,company_3M,company_ADP,company_AMD,company_ASML,...,month_03,month_04,month_05,month_06,month_07,month_08,month_09,month_10,month_11,month_12
0,127000,1.5,1.5,10000,20000,1,0,0,0,0,...,0,0,0,1,0,0,0,0,0,0
1,100000,5.0,3.0,0,0,1,0,0,0,0,...,0,0,0,1,0,0,0,0,0,0
2,310000,8.0,0.0,0,0,1,0,0,0,0,...,0,0,0,1,0,0,0,0,0,0
3,372000,7.0,5.0,35000,180000,1,0,0,0,0,...,0,0,0,1,0,0,0,0,0,0
4,157000,5.0,3.0,0,0,1,0,0,0,0,...,0,0,0,1,0,0,0,0,0,0

In [38]:
# Split our preprocessed data into our features and target arrays
X = dummies_df.drop(columns=['layoff_happened']).values
y = dummies_df['layoff_happened'].values

# Split the preprocessed data into a training and testing dataset
X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=1)

In [ ]:
# # Split our preprocessed data into our features and target arrays
# X = reduced_df.drop(columns=["totalyearlycompensation"]).values
# y = reduced_df["totalyearlycompensation"].values

# # Split the preprocessed data into a training and testing dataset
# X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=1)

In [39]:
# Create a StandardScaler instances
scaler = StandardScaler()

# Fit the StandardScaler
X_scaler = scaler.fit(X_train)

# Scale the data
X_train_scaled = X_scaler.transform(X_train)
X_test_scaled = X_scaler.transform(X_test)

In [40]:
from pickle import dump
# save the scaler
#https://machinelearningmastery.com/how-to-save-and-load-models-and-data-preparation-in-scikit-learn-for-later-use/

dump(X_scaler, open('scaler_layoff.pkl', 'wb'))

In [41]:
X.shape

(62642, 637)

In [42]:
#linear regression
# Import required libraries
import numpy as np
import pandas as pd

from pathlib import Path
from sklearn.linear_model import LinearRegression

In [ ]:
#model = LinearRegression()

In [ ]:
#y = dummies_df["totalyearlycompensation"].values

In [43]:
#random forest
import pandas as pd
from pathlib import Path
from sklearn.ensemble import RandomForestClassifier
from sklearn.ensemble import RandomForestRegressor
from sklearn.multioutput import MultiOutputRegressor
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split
from sklearn.metrics import confusion_matrix, accuracy_score, classification_report
%matplotlib inline

In [47]:
#https://stackoverflow.com/questions/52648383/how-to-get-coefficients-and-feature-importances-from-multioutputregressor
#rf_model = MultiOutputRegressor(RandomForestRegressor(n_estimators=500, random_state=78, max_depth=20))

In [44]:
rf_model = RandomForestClassifier(n_estimators=500, random_state=78, max_depth=20, n_jobs=-1, verbose=3)
#rf_model = RandomForestRegressor(n_estimators=500, random_state=7, max_depth=10)

In [45]:
rf_model = rf_model.fit(X_train_scaled, y_train)

[Parallel(n_jobs=-1)]: Using backend ThreadingBackend with 8 concurrent workers.

building tree 1 of 500
building tree 2 of 500
building tree 3 of 500
building tree 4 of 500
building tree 5 of 500
building tree 6 of 500
building tree 7 of 500
building tree 8 of 500
building tree 9 of 500
building tree 10 of 500
building tree 11 of 500
building tree 12 of 500
building tree 13 of 500
building tree 14 of 500
building tree 15 of 500
building tree 16 of 500
building tree 17 of 500
building tree 18 of 500
building tree 19 of 500
building tree 20 of 500
building tree 21 of 500
building tree 22 of 500
building tree 23 of 500
building tree 24 of 500

[Parallel(n_jobs=-1)]: Done  16 tasks      | elapsed:    2.3s

building tree 25 of 500
building tree 26 of 500
building tree 27 of 500
building tree 28 of 500
building tree 29 of 500
building tree 30 of 500
building tree 31 of 500
building tree 32 of 500
building tree 33 of 500
building tree 34 of 500
building tree 35 of 500
building tree 36 of 500
building tree 37 of 500
building tree 38 of 500
building tree 39 of 500
building tree 40 of 500
building tree 41 of 500
building tree 42 of 500
building tree 43 of 500
building tree 44 of 500
building tree 45 of 500
building tree 46 of 500
building tree 47 of 500
building tree 48 of 500
building tree 49 of 500
building tree 50 of 500
building tree 51 of 500
building tree 52 of 500
building tree 53 of 500
building tree 54 of 500
building tree 55 of 500
building tree 56 of 500
building tree 57 of 500
building tree 58 of 500
building tree 59 of 500
building tree 60 of 500
building tree 61 of 500
building tree 62 of 500
building tree 63 of 500
building tree 64 of 500
building tree 65 of 500
building tree 66 of 500
building tree 67 of 500
building tree 68 of 500
building tree 69 of 500
building tree 70 of 500
building tree 71 of 500
building tree 72 of 500
building tree 73 of 500
building tree 74 of 500
building tree 75 of 500
building tree 76 of 500
building tree 77 of 500
building tree 78 of 500
building tree 79 of 500
building tree 80 of 500
building tree 81 of 500
building tree 82 of 500
building tree 83 of 500
building tree 84 of 500
building tree 85 of 500
building tree 86 of 500
building tree 87 of 500
building tree 88 of 500
building tree 89 of 500
building tree 90 of 500
building tree 91 of 500
building tree 92 of 500
building tree 93 of 500
building tree 94 of 500
building tree 95 of 500
building tree 96 of 500
building tree 97 of 500
building tree 98 of 500
building tree 99 of 500
building tree 100 of 500
building tree 101 of 500
building tree 102 of 500
building tree 103 of 500
building tree 104 of 500
building tree 105 of 500
building tree 106 of 500
building tree 107 of 500
building tree 108 of 500
building tree 109 of 500
building tree 110 of 500
building tree 111 of 500
building tree 112 of 500
building tree 113 of 500
building tree 114 of 500
building tree 115 of 500
building tree 116 of 500
building tree 117 of 500
building tree 118 of 500
building tree 119 of 500
building tree 120 of 500
building tree 121 of 500
building tree 122 of 500

[Parallel(n_jobs=-1)]: Done 112 tasks      | elapsed:   15.0s

building tree 123 of 500
building tree 124 of 500
building tree 125 of 500
building tree 126 of 500
building tree 127 of 500
building tree 128 of 500
building tree 129 of 500
building tree 130 of 500
building tree 131 of 500
building tree 132 of 500
building tree 133 of 500
building tree 134 of 500
building tree 135 of 500
building tree 136 of 500
building tree 137 of 500
building tree 138 of 500
building tree 139 of 500
building tree 140 of 500
building tree 141 of 500
building tree 142 of 500
building tree 143 of 500
building tree 144 of 500
building tree 145 of 500
building tree 146 of 500
building tree 147 of 500
building tree 148 of 500
building tree 149 of 500
building tree 150 of 500
building tree 151 of 500
building tree 152 of 500
building tree 153 of 500
building tree 154 of 500
building tree 155 of 500
building tree 156 of 500
building tree 157 of 500
building tree 158 of 500
building tree 159 of 500
building tree 160 of 500
building tree 161 of 500
building tree 162 of 500
building tree 163 of 500
building tree 164 of 500
building tree 165 of 500
building tree 166 of 500
building tree 167 of 500
building tree 168 of 500
building tree 169 of 500
building tree 170 of 500
building tree 171 of 500
building tree 172 of 500
building tree 173 of 500
building tree 174 of 500
building tree 175 of 500
building tree 176 of 500
building tree 177 of 500
building tree 178 of 500
building tree 179 of 500
building tree 180 of 500
building tree 181 of 500
building tree 182 of 500
building tree 183 of 500
building tree 184 of 500
building tree 185 of 500
building tree 186 of 500
building tree 187 of 500
building tree 188 of 500
building tree 189 of 500
building tree 190 of 500
building tree 191 of 500
building tree 192 of 500
building tree 193 of 500
building tree 194 of 500
building tree 195 of 500
building tree 196 of 500
building tree 197 of 500
building tree 198 of 500
building tree 199 of 500
building tree 200 of 500
building tree 201 of 500
building tree 202 of 500
building tree 203 of 500
building tree 204 of 500
building tree 205 of 500
building tree 206 of 500
building tree 207 of 500
building tree 208 of 500
building tree 209 of 500
building tree 210 of 500
building tree 211 of 500
building tree 212 of 500
building tree 213 of 500
building tree 214 of 500
building tree 215 of 500
building tree 216 of 500
building tree 217 of 500
building tree 218 of 500
building tree 219 of 500
building tree 220 of 500
building tree 221 of 500
building tree 222 of 500
building tree 223 of 500
building tree 224 of 500
building tree 225 of 500
building tree 226 of 500
building tree 227 of 500
building tree 228 of 500
building tree 229 of 500
building tree 230 of 500
building tree 231 of 500
building tree 232 of 500
building tree 233 of 500
building tree 234 of 500
building tree 235 of 500
building tree 236 of 500
building tree 237 of 500
building tree 238 of 500
building tree 239 of 500
building tree 240 of 500
building tree 241 of 500
building tree 242 of 500
building tree 243 of 500
building tree 244 of 500
building tree 245 of 500
building tree 246 of 500
building tree 247 of 500
building tree 248 of 500
building tree 249 of 500
building tree 250 of 500
building tree 251 of 500
building tree 252 of 500
building tree 253 of 500
building tree 254 of 500
building tree 255 of 500
building tree 256 of 500
building tree 257 of 500
building tree 258 of 500
building tree 259 of 500
building tree 260 of 500
building tree 261 of 500
building tree 262 of 500
building tree 263 of 500
building tree 264 of 500
building tree 265 of 500
building tree 266 of 500
building tree 267 of 500
building tree 268 of 500
building tree 269 of 500
building tree 270 of 500
building tree 271 of 500
building tree 272 of 500
building tree 273 of 500
building tree 274 of 500
building tree 275 of 500
building tree 276 of 500
building tree 277 of 500
building tree 278 of 500
building tree 279 of 500
building tree 280 of 500

[Parallel(n_jobs=-1)]: Done 272 tasks      | elapsed:   37.9s

building tree 281 of 500
building tree 282 of 500
building tree 283 of 500
building tree 284 of 500
building tree 285 of 500
building tree 286 of 500
building tree 287 of 500
building tree 288 of 500
building tree 289 of 500
building tree 290 of 500
building tree 291 of 500
building tree 292 of 500
building tree 293 of 500
building tree 294 of 500
building tree 295 of 500
building tree 296 of 500
building tree 297 of 500
building tree 298 of 500
building tree 299 of 500
building tree 300 of 500
building tree 301 of 500building tree 302 of 500

building tree 303 of 500
building tree 304 of 500
building tree 305 of 500
building tree 306 of 500
building tree 307 of 500
building tree 308 of 500
building tree 309 of 500
building tree 310 of 500
building tree 311 of 500
building tree 312 of 500
building tree 313 of 500
building tree 314 of 500
building tree 315 of 500
building tree 316 of 500
building tree 317 of 500
building tree 318 of 500
building tree 319 of 500
building tree 320 of 500
building tree 321 of 500
building tree 322 of 500
building tree 323 of 500
building tree 324 of 500
building tree 325 of 500
building tree 326 of 500
building tree 327 of 500
building tree 328 of 500
building tree 329 of 500
building tree 330 of 500
building tree 331 of 500
building tree 332 of 500
building tree 333 of 500
building tree 334 of 500
building tree 335 of 500
building tree 336 of 500
building tree 337 of 500
building tree 338 of 500
building tree 339 of 500
building tree 340 of 500
building tree 341 of 500
building tree 342 of 500
building tree 343 of 500
building tree 344 of 500
building tree 345 of 500
building tree 346 of 500
building tree 347 of 500
building tree 348 of 500
building tree 349 of 500
building tree 350 of 500
building tree 351 of 500
building tree 352 of 500
building tree 353 of 500
building tree 354 of 500
building tree 355 of 500
building tree 356 of 500
building tree 357 of 500
building tree 358 of 500
building tree 359 of 500
building tree 360 of 500
building tree 361 of 500
building tree 362 of 500
building tree 363 of 500
building tree 364 of 500
building tree 365 of 500
building tree 366 of 500
building tree 367 of 500
building tree 368 of 500
building tree 369 of 500
building tree 370 of 500
building tree 371 of 500
building tree 372 of 500
building tree 373 of 500
building tree 374 of 500
building tree 375 of 500
building tree 376 of 500
building tree 377 of 500
building tree 378 of 500
building tree 379 of 500
building tree 380 of 500
building tree 381 of 500
building tree 382 of 500
building tree 383 of 500
building tree 384 of 500
building tree 385 of 500
building tree 386 of 500
building tree 387 of 500
building tree 388 of 500
building tree 389 of 500
building tree 390 of 500
building tree 391 of 500
building tree 392 of 500
building tree 393 of 500
building tree 394 of 500
building tree 395 of 500
building tree 396 of 500
building tree 397 of 500
building tree 398 of 500
building tree 399 of 500
building tree 400 of 500
building tree 401 of 500
building tree 402 of 500
building tree 403 of 500
building tree 404 of 500
building tree 405 of 500
building tree 406 of 500
building tree 407 of 500
building tree 408 of 500
building tree 409 of 500
building tree 410 of 500
building tree 411 of 500
building tree 412 of 500
building tree 413 of 500
building tree 414 of 500
building tree 415 of 500
building tree 416 of 500
building tree 417 of 500
building tree 418 of 500
building tree 419 of 500
building tree 420 of 500
building tree 421 of 500
building tree 422 of 500
building tree 423 of 500
building tree 424 of 500
building tree 425 of 500
building tree 426 of 500
building tree 427 of 500
building tree 428 of 500
building tree 429 of 500
building tree 430 of 500
building tree 431 of 500
building tree 432 of 500
building tree 433 of 500
building tree 434 of 500
building tree 435 of 500
building tree 436 of 500
building tree 437 of 500
building tree 438 of 500
building tree 439 of 500
building tree 440 of 500
building tree 441 of 500
building tree 442 of 500
building tree 443 of 500
building tree 444 of 500
building tree 445 of 500
building tree 446 of 500
building tree 447 of 500
building tree 448 of 500
building tree 449 of 500
building tree 450 of 500
building tree 451 of 500
building tree 452 of 500
building tree 453 of 500
building tree 454 of 500
building tree 455 of 500
building tree 456 of 500
building tree 457 of 500
building tree 458 of 500
building tree 459 of 500
building tree 460 of 500
building tree 461 of 500
building tree 462 of 500
building tree 463 of 500
building tree 464 of 500
building tree 465 of 500
building tree 466 of 500
building tree 467 of 500
building tree 468 of 500
building tree 469 of 500
building tree 470 of 500
building tree 471 of 500
building tree 472 of 500
building tree 473 of 500
building tree 474 of 500
building tree 475 of 500
building tree 476 of 500
building tree 477 of 500
building tree 478 of 500
building tree 479 of 500
building tree 480 of 500
building tree 481 of 500
building tree 482 of 500
building tree 483 of 500
building tree 484 of 500
building tree 485 of 500
building tree 486 of 500
building tree 487 of 500
building tree 488 of 500
building tree 489 of 500
building tree 490 of 500
building tree 491 of 500
building tree 492 of 500
building tree 493 of 500
building tree 494 of 500
building tree 495 of 500
building tree 496 of 500
building tree 497 of 500
building tree 498 of 500
building tree 499 of 500
building tree 500 of 500

[Parallel(n_jobs=-1)]: Done 500 out of 500 | elapsed:  1.2min finished

In [46]:
predictions = rf_model.predict(X_test_scaled)

[Parallel(n_jobs=8)]: Using backend ThreadingBackend with 8 concurrent workers.
[Parallel(n_jobs=8)]: Done  16 tasks      | elapsed:    0.0s
[Parallel(n_jobs=8)]: Done 112 tasks      | elapsed:    0.2s
[Parallel(n_jobs=8)]: Done 272 tasks      | elapsed:    0.5s
[Parallel(n_jobs=8)]: Done 500 out of 500 | elapsed:    1.0s finished

In [47]:
cm = confusion_matrix(y_test, predictions)
cm_df = pd.DataFrame(
    cm, index=["Actual 0", "Actual 1"], columns=["Predicted 0", "Predicted 1"]
)

# Calculating the accuracy score
acc_score = accuracy_score(y_test, predictions)
acc_score
#0.8925355979822489 with location instead of long and lat
#0.8959198007790051 without level

0.8959198007790051

In [52]:
# Displaying results
print("Confusion Matrix")
display(cm_df)
print(f"Accuracy Score : {acc_score}")
print("Classification Report")
print(classification_report(y_test, predictions))

Confusion Matrix

          Predicted 0  Predicted 1
Actual 0         4506         1273
Actual 1          410         9472

Accuracy Score : 0.8925355979822489
Classification Report
              precision    recall  f1-score   support

           0       0.92      0.78      0.84      5779
           1       0.88      0.96      0.92      9882

    accuracy                           0.89     15661
   macro avg       0.90      0.87      0.88     15661
weighted avg       0.89      0.89      0.89     15661

In [54]:
# plt.figure(figsize=(16,7))
# sns.set(font_scale=1.4)
# sns.heatmap(cm, annot=True, annot_kws={'size':10},
#             cmap=plt.cm.Greens, linewidths=0.2)

In [55]:
import pickle
pickle.dump(rf_model, open('l_ml_model.pkl', 'wb'))